MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64GS608/mcu.h
#define ADCPC3 ADCPC3
extern volatile uint16_t ADCPC3 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC3BITS {
  union {
    struct {
      uint16_t TRGSRC6:5;
      uint16_t SWTRG6:1;
      uint16_t PEND6:1;
      uint16_t IRQEN6:1;
      uint16_t TRGSRC7:5;
      uint16_t SWTRG7:1;
      uint16_t PEND7:1;
      uint16_t IRQEN7:1;
    };
    struct {
      uint16_t TRGSRC60:1;
      uint16_t TRGSRC61:1;
      uint16_t TRGSRC62:1;
      uint16_t TRGSRC63:1;
      uint16_t TRGSRC64:1;
      uint16_t :3;
      uint16_t TRGSRC70:1;
      uint16_t TRGSRC71:1;
      uint16_t TRGSRC72:1;
      uint16_t TRGSRC73:1;
      uint16_t TRGSRC74:1;
    };
  };
} ADCPC3BITS;
extern volatile ADCPC3BITS ADCPC3bits __attribute__((__sfr__));

#define ADCPC4 ADCPC4
extern volatile uint16_t ADCPC4 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC4BITS {
  union {
    struct {
      uint16_t TRGSRC8:5;
      uint16_t SWTRG8:1;
      uint16_t PEND8:1;
      uint16_t IRQEN8:1;
    };
    struct {
      uint16_t TRGSRC80:1;
      uint16_t TRGSRC81:1;
      uint16_t TRGSRC82:1;
      uint16_t TRGSRC83:1;
      uint16_t TRGSRC84:1;
    };
  };
} ADCPC4BITS;
extern volatile ADCPC4BITS ADCPC4bits __attribute__((__sfr__));

#define ADCPC6 ADCPC6
extern volatile uint16_t ADCPC6 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC6BITS {
  union {
    struct {
      uint16_t TRGSRC12:5;
      uint16_t SWTRG12:1;
      uint16_t PEND12:1;
      uint16_t IRQEN12:1;
    };
    struct {
      uint16_t TRGSRC120:1;
      uint16_t TRGSRC121:1;
      uint16_t TRGSRC122:1;
      uint16_t TRGSRC123:1;
      uint16_t TRGSRC124:1;
    };
  };
} ADCPC6BITS;
extern volatile ADCPC6BITS ADCPC6bits __attribute__((__sfr__));

#define ADCBUF0 ADCBUF0
extern volatile uint16_t ADCBUF0 __attribute__((__sfr__));
#define ADCBUF1 ADCBUF1
extern volatile uint16_t ADCBUF1 __attribute__((__sfr__));
#define ADCBUF2 ADCBUF2
extern volatile uint16_t ADCBUF2 __attribute__((__sfr__));
#define ADCBUF3 ADCBUF3
extern volatile uint16_t ADCBUF3 __attribute__((__sfr__));
#define ADCBUF4 ADCBUF4
extern volatile uint16_t ADCBUF4 __attribute__((__sfr__));
#define ADCBUF5 ADCBUF5
extern volatile uint16_t ADCBUF5 __attribute__((__sfr__));
#define ADCBUF6 ADCBUF6
extern volatile uint16_t ADCBUF6 __attribute__((__sfr__));
#define ADCBUF7 ADCBUF7
extern volatile uint16_t ADCBUF7 __attribute__((__sfr__));
#define ADCBUF8 ADCBUF8
extern volatile uint16_t ADCBUF8 __attribute__((__sfr__));
#define ADCBUF9 ADCBUF9
extern volatile uint16_t ADCBUF9 __attribute__((__sfr__));
#define ADCBUF10 ADCBUF10
extern volatile uint16_t ADCBUF10 __attribute__((__sfr__));
#define ADCBUF11 ADCBUF11
extern volatile uint16_t ADCBUF11 __attribute__((__sfr__));
#define ADCBUF12 ADCBUF12
extern volatile uint16_t ADCBUF12 __attribute__((__sfr__));
#define ADCBUF13 ADCBUF13
extern volatile uint16_t ADCBUF13 __attribute__((__sfr__));
#define ADCBUF14 ADCBUF14
extern volatile uint16_t ADCBUF14 __attribute__((__sfr__));
#define ADCBUF15 ADCBUF15
extern volatile uint16_t ADCBUF15 __attribute__((__sfr__));
#define ADCBUF16 ADCBUF16
extern volatile uint16_t ADCBUF16 __attribute__((__sfr__));
#define ADCBUF17 ADCBUF17
extern volatile uint16_t ADCBUF17 __attribute__((__sfr__));
#define ADCBUF24 ADCBUF24
extern volatile uint16_t ADCBUF24 __attribute__((__sfr__));
#define ADCBUF25 ADCBUF25
extern volatile uint16_t ADCBUF25 __attribute__((__sfr__));
#define DMA0CON DMA0CON
extern volatile uint16_t DMA0CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA0CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA0CONBITS;
extern volatile DMA0CONBITS DMA0CONbits __attribute__((__sfr__));

#define DMA0REQ DMA0REQ
extern volatile uint16_t DMA0REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA0REQBITS {
  union {
    struct {
      uint16_t IRQSEL:7;
      uint16_t :8;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
    };
  };
} DMA0REQBITS;
extern volatile DMA0REQBITS DMA0REQbits __attribute__((__sfr__));

#define DMA0STA DMA0STA
extern volatile uint16_t DMA0STA __attribute__((__sfr__));
#define DMA0STB DMA0STB
extern volatile uint16_t DMA0STB __attribute__((__sfr__));
#define DMA0PAD DMA0PAD
extern volatile uint16_t DMA0PAD __attribute__((__sfr__));
#define DMA0CNT DMA0CNT
extern volatile uint16_t DMA0CNT __attribute__((__sfr__));
#define DMA1CON DMA1CON
extern volatile uint16_t DMA1CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA1CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA1CONBITS;
extern volatile DMA1CONBITS DMA1CONbits __attribute__((__sfr__));

#define DMA1REQ DMA1REQ
extern volatile uint16_t DMA1REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA1REQBITS {
  union {
    struct {
      uint16_t IRQSEL:7;
      uint16_t :8;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
    };
  };
} DMA1REQBITS;
extern volatile DMA1REQBITS DMA1REQbits __attribute__((__sfr__));

#define DMA1STA DMA1STA
extern volatile uint16_t DMA1STA __attribute__((__sfr__));
#define DMA1STB DMA1STB
extern volatile uint16_t DMA1STB __attribute__((__sfr__));
#define DMA1PAD DMA1PAD
extern volatile uint16_t DMA1PAD __attribute__((__sfr__));
#define DMA1CNT DMA1CNT
extern volatile uint16_t DMA1CNT __attribute__((__sfr__));
#define DMA2CON DMA2CON
extern volatile uint16_t DMA2CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA2CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA2CONBITS;
extern volatile DMA2CONBITS DMA2CONbits __attribute__((__sfr__));

#define DMA2REQ DMA2REQ
extern volatile uint16_t DMA2REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA2REQBITS {
  union {
    struct {
      uint16_t IRQSEL:7;
      uint16_t :8;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
    };
  };
} DMA2REQBITS;
extern volatile DMA2REQBITS DMA2REQbits __attribute__((__sfr__));

#define DMA2STA DMA2STA
extern volatile uint16_t DMA2STA __attribute__((__sfr__));
#define DMA2STB DMA2STB
extern volatile uint16_t DMA2STB __attribute__((__sfr__));
#define DMA2PAD DMA2PAD
extern volatile uint16_t DMA2PAD __attribute__((__sfr__));
#define DMA2CNT DMA2CNT
extern volatile uint16_t DMA2CNT __attribute__((__sfr__));
#define DMA3CON DMA3CON
extern volatile uint16_t DMA3CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA3CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA3CONBITS;
extern volatile DMA3CONBITS DMA3CONbits __attribute__((__sfr__));

