MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64GS608/mcu.h
#define _TRGCON1_TRGSTRT3_POSITION               0x00000003
#define _TRGCON1_TRGSTRT3_MASK                   0x00000008
#define _TRGCON1_TRGSTRT3_LENGTH                 0x00000001

#define _TRGCON1_TRGSTRT4_POSITION               0x00000004
#define _TRGCON1_TRGSTRT4_MASK                   0x00000010
#define _TRGCON1_TRGSTRT4_LENGTH                 0x00000001

#define _TRGCON1_TRGSTRT5_POSITION               0x00000005
#define _TRGCON1_TRGSTRT5_MASK                   0x00000020
#define _TRGCON1_TRGSTRT5_LENGTH                 0x00000001

#define _TRGCON1_TRGDIV0_POSITION                0x0000000C
#define _TRGCON1_TRGDIV0_MASK                    0x00001000
#define _TRGCON1_TRGDIV0_LENGTH                  0x00000001

#define _TRGCON1_TRGDIV1_POSITION                0x0000000D
#define _TRGCON1_TRGDIV1_MASK                    0x00002000
#define _TRGCON1_TRGDIV1_LENGTH                  0x00000001

#define _TRGCON1_TRGDIV2_POSITION                0x0000000E
#define _TRGCON1_TRGDIV2_MASK                    0x00004000
#define _TRGCON1_TRGDIV2_LENGTH                  0x00000001

#define _TRGCON1_TRGDIV3_POSITION                0x0000000F
#define _TRGCON1_TRGDIV3_MASK                    0x00008000
#define _TRGCON1_TRGDIV3_LENGTH                  0x00000001

#define _STRIG1_STRGCMP_POSITION                 0x00000003
#define _STRIG1_STRGCMP_MASK                     0x0000FFF8
#define _STRIG1_STRGCMP_LENGTH                   0x0000000D

#define _STRIG1_STRGCMP0_POSITION                0x00000003
#define _STRIG1_STRGCMP0_MASK                    0x00000008
#define _STRIG1_STRGCMP0_LENGTH                  0x00000001

#define _STRIG1_STRGCMP1_POSITION                0x00000004
#define _STRIG1_STRGCMP1_MASK                    0x00000010
#define _STRIG1_STRGCMP1_LENGTH                  0x00000001

#define _STRIG1_STRGCMP2_POSITION                0x00000005
#define _STRIG1_STRGCMP2_MASK                    0x00000020
#define _STRIG1_STRGCMP2_LENGTH                  0x00000001

#define _STRIG1_STRGCMP3_POSITION                0x00000006
#define _STRIG1_STRGCMP3_MASK                    0x00000040
#define _STRIG1_STRGCMP3_LENGTH                  0x00000001

#define _STRIG1_STRGCMP4_POSITION                0x00000007
#define _STRIG1_STRGCMP4_MASK                    0x00000080
#define _STRIG1_STRGCMP4_LENGTH                  0x00000001

#define _STRIG1_STRGCMP5_POSITION                0x00000008
#define _STRIG1_STRGCMP5_MASK                    0x00000100
#define _STRIG1_STRGCMP5_LENGTH                  0x00000001

#define _STRIG1_STRGCMP6_POSITION                0x00000009
#define _STRIG1_STRGCMP6_MASK                    0x00000200
#define _STRIG1_STRGCMP6_LENGTH                  0x00000001

#define _STRIG1_STRGCMP7_POSITION                0x0000000A
#define _STRIG1_STRGCMP7_MASK                    0x00000400
#define _STRIG1_STRGCMP7_LENGTH                  0x00000001

#define _STRIG1_STRGCMP8_POSITION                0x0000000B
#define _STRIG1_STRGCMP8_MASK                    0x00000800
#define _STRIG1_STRGCMP8_LENGTH                  0x00000001

#define _STRIG1_STRGCMP9_POSITION                0x0000000C
#define _STRIG1_STRGCMP9_MASK                    0x00001000
#define _STRIG1_STRGCMP9_LENGTH                  0x00000001

#define _STRIG1_STRGCMP10_POSITION               0x0000000D
#define _STRIG1_STRGCMP10_MASK                   0x00002000
#define _STRIG1_STRGCMP10_LENGTH                 0x00000001

#define _STRIG1_STRGCMP11_POSITION               0x0000000E
#define _STRIG1_STRGCMP11_MASK                   0x00004000
#define _STRIG1_STRGCMP11_LENGTH                 0x00000001

#define _STRIG1_STRGCMP12_POSITION               0x0000000F
#define _STRIG1_STRGCMP12_MASK                   0x00008000
#define _STRIG1_STRGCMP12_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP10_POSITION               0x00000003
#define _PWMCAP1_PWMCAP10_MASK                   0x00000008
#define _PWMCAP1_PWMCAP10_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP11_POSITION               0x00000004
#define _PWMCAP1_PWMCAP11_MASK                   0x00000010
#define _PWMCAP1_PWMCAP11_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP12_POSITION               0x00000005
#define _PWMCAP1_PWMCAP12_MASK                   0x00000020
#define _PWMCAP1_PWMCAP12_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP13_POSITION               0x00000006
#define _PWMCAP1_PWMCAP13_MASK                   0x00000040
#define _PWMCAP1_PWMCAP13_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP14_POSITION               0x00000007
#define _PWMCAP1_PWMCAP14_MASK                   0x00000080
#define _PWMCAP1_PWMCAP14_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP15_POSITION               0x00000008
#define _PWMCAP1_PWMCAP15_MASK                   0x00000100
#define _PWMCAP1_PWMCAP15_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP16_POSITION               0x00000009
#define _PWMCAP1_PWMCAP16_MASK                   0x00000200
#define _PWMCAP1_PWMCAP16_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP17_POSITION               0x0000000A
#define _PWMCAP1_PWMCAP17_MASK                   0x00000400
#define _PWMCAP1_PWMCAP17_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP18_POSITION               0x0000000B
#define _PWMCAP1_PWMCAP18_MASK                   0x00000800
#define _PWMCAP1_PWMCAP18_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP19_POSITION               0x0000000C
#define _PWMCAP1_PWMCAP19_MASK                   0x00001000
#define _PWMCAP1_PWMCAP19_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP110_POSITION              0x0000000D
#define _PWMCAP1_PWMCAP110_MASK                  0x00002000
#define _PWMCAP1_PWMCAP110_LENGTH                0x00000001

#define _PWMCAP1_PWMCAP111_POSITION              0x0000000E
#define _PWMCAP1_PWMCAP111_MASK                  0x00004000
#define _PWMCAP1_PWMCAP111_LENGTH                0x00000001

#define _PWMCAP1_PWMCAP112_POSITION              0x0000000F
#define _PWMCAP1_PWMCAP112_MASK                  0x00008000
#define _PWMCAP1_PWMCAP112_LENGTH                0x00000001

