MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64GS608/mcu.h
#define _PWMCON8_IUE_POSITION                    0x00000000
#define _PWMCON8_IUE_MASK                        0x00000001
#define _PWMCON8_IUE_LENGTH                      0x00000001

#define _PWMCON8_XPRES_POSITION                  0x00000001
#define _PWMCON8_XPRES_MASK                      0x00000002
#define _PWMCON8_XPRES_LENGTH                    0x00000001

#define _PWMCON8_CAM_POSITION                    0x00000002
#define _PWMCON8_CAM_MASK                        0x00000004
#define _PWMCON8_CAM_LENGTH                      0x00000001

#define _PWMCON8_MTBS_POSITION                   0x00000003
#define _PWMCON8_MTBS_MASK                       0x00000008
#define _PWMCON8_MTBS_LENGTH                     0x00000001

#define _PWMCON8_DTCP_POSITION                   0x00000005
#define _PWMCON8_DTCP_MASK                       0x00000020
#define _PWMCON8_DTCP_LENGTH                     0x00000001

#define _PWMCON8_DTC_POSITION                    0x00000006
#define _PWMCON8_DTC_MASK                        0x000000C0
#define _PWMCON8_DTC_LENGTH                      0x00000002

#define _PWMCON8_MDCS_POSITION                   0x00000008
#define _PWMCON8_MDCS_MASK                       0x00000100
#define _PWMCON8_MDCS_LENGTH                     0x00000001

#define _PWMCON8_ITB_POSITION                    0x00000009
#define _PWMCON8_ITB_MASK                        0x00000200
#define _PWMCON8_ITB_LENGTH                      0x00000001

#define _PWMCON8_TRGIEN_POSITION                 0x0000000A
#define _PWMCON8_TRGIEN_MASK                     0x00000400
#define _PWMCON8_TRGIEN_LENGTH                   0x00000001

#define _PWMCON8_CLIEN_POSITION                  0x0000000B
#define _PWMCON8_CLIEN_MASK                      0x00000800
#define _PWMCON8_CLIEN_LENGTH                    0x00000001

#define _PWMCON8_FLTIEN_POSITION                 0x0000000C
#define _PWMCON8_FLTIEN_MASK                     0x00001000
#define _PWMCON8_FLTIEN_LENGTH                   0x00000001

#define _PWMCON8_TRGSTAT_POSITION                0x0000000D
#define _PWMCON8_TRGSTAT_MASK                    0x00002000
#define _PWMCON8_TRGSTAT_LENGTH                  0x00000001

#define _PWMCON8_CLSTAT_POSITION                 0x0000000E
#define _PWMCON8_CLSTAT_MASK                     0x00004000
#define _PWMCON8_CLSTAT_LENGTH                   0x00000001

#define _PWMCON8_FLTSTAT_POSITION                0x0000000F
#define _PWMCON8_FLTSTAT_MASK                    0x00008000
#define _PWMCON8_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON8_DTC0_POSITION                   0x00000006
#define _PWMCON8_DTC0_MASK                       0x00000040
#define _PWMCON8_DTC0_LENGTH                     0x00000001

#define _PWMCON8_DTC1_POSITION                   0x00000007
#define _PWMCON8_DTC1_MASK                       0x00000080
#define _PWMCON8_DTC1_LENGTH                     0x00000001

#define _IOCON8_OSYNC_POSITION                   0x00000000
#define _IOCON8_OSYNC_MASK                       0x00000001
#define _IOCON8_OSYNC_LENGTH                     0x00000001

#define _IOCON8_SWAP_POSITION                    0x00000001
#define _IOCON8_SWAP_MASK                        0x00000002
#define _IOCON8_SWAP_LENGTH                      0x00000001

#define _IOCON8_CLDAT_POSITION                   0x00000002
#define _IOCON8_CLDAT_MASK                       0x0000000C
#define _IOCON8_CLDAT_LENGTH                     0x00000002

#define _IOCON8_FLTDAT_POSITION                  0x00000004
#define _IOCON8_FLTDAT_MASK                      0x00000030
#define _IOCON8_FLTDAT_LENGTH                    0x00000002

#define _IOCON8_OVRDAT_POSITION                  0x00000006
#define _IOCON8_OVRDAT_MASK                      0x000000C0
#define _IOCON8_OVRDAT_LENGTH                    0x00000002

#define _IOCON8_OVRENL_POSITION                  0x00000008
#define _IOCON8_OVRENL_MASK                      0x00000100
#define _IOCON8_OVRENL_LENGTH                    0x00000001

#define _IOCON8_OVRENH_POSITION                  0x00000009
#define _IOCON8_OVRENH_MASK                      0x00000200
#define _IOCON8_OVRENH_LENGTH                    0x00000001

#define _IOCON8_PMOD_POSITION                    0x0000000A
#define _IOCON8_PMOD_MASK                        0x00000C00
#define _IOCON8_PMOD_LENGTH                      0x00000002

#define _IOCON8_POLL_POSITION                    0x0000000C
#define _IOCON8_POLL_MASK                        0x00001000
#define _IOCON8_POLL_LENGTH                      0x00000001

#define _IOCON8_POLH_POSITION                    0x0000000D
#define _IOCON8_POLH_MASK                        0x00002000
#define _IOCON8_POLH_LENGTH                      0x00000001

#define _IOCON8_PENL_POSITION                    0x0000000E
#define _IOCON8_PENL_MASK                        0x00004000
#define _IOCON8_PENL_LENGTH                      0x00000001

#define _IOCON8_PENH_POSITION                    0x0000000F
#define _IOCON8_PENH_MASK                        0x00008000
#define _IOCON8_PENH_LENGTH                      0x00000001

#define _IOCON8_CLDAT0_POSITION                  0x00000002
#define _IOCON8_CLDAT0_MASK                      0x00000004
#define _IOCON8_CLDAT0_LENGTH                    0x00000001

#define _IOCON8_CLDAT1_POSITION                  0x00000003
#define _IOCON8_CLDAT1_MASK                      0x00000008
#define _IOCON8_CLDAT1_LENGTH                    0x00000001

#define _IOCON8_FLTDAT0_POSITION                 0x00000004
#define _IOCON8_FLTDAT0_MASK                     0x00000010
#define _IOCON8_FLTDAT0_LENGTH                   0x00000001

#define _IOCON8_FLTDAT1_POSITION                 0x00000005
#define _IOCON8_FLTDAT1_MASK                     0x00000020
#define _IOCON8_FLTDAT1_LENGTH                   0x00000001

#define _IOCON8_OVRDAT0_POSITION                 0x00000006
#define _IOCON8_OVRDAT0_MASK                     0x00000040
#define _IOCON8_OVRDAT0_LENGTH                   0x00000001

#define _IOCON8_OVRDAT1_POSITION                 0x00000007
#define _IOCON8_OVRDAT1_MASK                     0x00000080
#define _IOCON8_OVRDAT1_LENGTH                   0x00000001

#define _IOCON8_PMOD0_POSITION                   0x0000000A
#define _IOCON8_PMOD0_MASK                       0x00000400
#define _IOCON8_PMOD0_LENGTH                     0x00000001

#define _IOCON8_PMOD1_POSITION                   0x0000000B
#define _IOCON8_PMOD1_MASK                       0x00000800
#define _IOCON8_PMOD1_LENGTH                     0x00000001

#define _FCLCON8_FLTMOD_POSITION                 0x00000000
#define _FCLCON8_FLTMOD_MASK                     0x00000003
#define _FCLCON8_FLTMOD_LENGTH                   0x00000002

